Revit 2026 API

# FilteredWorksetCollector Class

---

This class is used to search, filter and iterate through a set of worksets.

SystemObject Autodesk.Revit.DBFilteredWorksetCollector

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilteredWorksetCollector : IEnumerable<Workset>,
	IDisposable
```
```vb
Public Class FilteredWorksetCollector
	Implements IEnumerable(Of Workset), IDisposable
```
```cpp
public ref class FilteredWorksetCollector : IEnumerable<Workset^>,
	IDisposable
```
```fsharp
type FilteredWorksetCollector =
    class
        interface IEnumerable<Workset>
        interface IDisposable
    end
```

The FilteredWorksetCollector type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilteredWorksetCollector | Constructs a new FilteredWorksetCollector that will search and filter the set of worksets in a document. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilteredWorksetCollector |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | FirstWorkset | Returns the first workset to pass the filter(s). |
|  | FirstWorksetId | Returns the id of the first workset to pass the filter(s). |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWorksetIdIterator | Returns a FilteredWorksetIdIterator to the worksets passing the current filter. |
|  | GetWorksetIterator | Returns a FilteredWorksetIterator to the worksets passing the current filter. |
|  | OfKind | Applies a WorksetKindFilter to the collector. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | ToWorksetIds | Returns the complete set of workset ids that pass the filter(s). |
|  | ToWorksets | Returns the complete set of worksets that pass the filter(s). |
|  | WherePasses | Applies a workset filter to the collector. |

Developers can assign a condition to filter the worksets that are returned. If no condition is applied, it attempts to access all the worksets in the document.

The collector will reset if you call another method to extract worksets. Thus, if you have previously obtained an iterator, it will be stopped and traverse no more worksets if you call another method to extract worksets.

#### Reference

Autodesk.Revit.DB Namespace